bookstore_api/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "books"
---
  def index
    @books = Book.limit(params[:limit])

    render json: @books, meta: { total: Book.count }